In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
seri = pd.Series([1,2,3,4,5,6])

In [4]:
seri

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [5]:
seri1=pd.Series(["ankara","istanbul","izmir","bursa","antalya"])
seri1

0      ankara
1    istanbul
2       izmir
3       bursa
4     antalya
dtype: object

In [7]:
liste=[1,2,3,4,5,6]
seri2 = pd.Series(liste)
seri2

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [8]:
a=np.arange(1,10)

In [9]:
seri3=pd.Series(a)

In [10]:
seri3

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int32

In [11]:
seri3.axes

[RangeIndex(start=0, stop=9, step=1)]

In [12]:
seri3.dtype

dtype('int32')

In [13]:
seri3.ndim

1

In [14]:
seri3.shape

(9,)

In [15]:
seri3.values

array([1, 2, 3, 4, 5, 6, 7, 8, 9])

In [16]:
seri3.head()

0    1
1    2
2    3
3    4
4    5
dtype: int32

In [18]:
seri3.tail()

4    5
5    6
6    7
7    8
8    9
dtype: int32

In [19]:
seri4=pd.Series(([1,2,3,4,5,6]), index=(0,2,4,6,8,10))
seri4

0     1
2     2
4     3
6     4
8     5
10    6
dtype: int64

In [20]:
pd.DataFrame([1,2,3,4,5,6],columns=["sütun"])

   sütun
0      1
1      2
2      3
3      4
4      5
5      6

In [23]:
a=np.random.randint(10,size=6)
b=np.random.randint(10,size=6)
c=np.random.randint(10,size=6)
data=pd.DataFrame({"s1":a,"s2":b,"s3":c})
data

   s1  s2  s3
0   2   5   1
1   1   2   2
2   7   6   1
3   1   6   1
4   2   0   6
5   7   1   6

In [24]:
data.drop(1,axis=0)

   s1  s2  s3
0   2   5   1
2   7   6   1
3   1   6   1
4   2   0   6
5   7   1   6

In [25]:
data

   s1  s2  s3
0   2   5   1
1   1   2   2
2   7   6   1
3   1   6   1
4   2   0   6
5   7   1   6